app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
---
    def index
        puts "hit our index view"
        @pets = Pet.all

INSERT INTO "pets" ("name", "species", "year_of_birth", "good_with_kids", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mr Squiggles"], ["species", "dog"], ["year_of_birth", 2010], ["good_with_kids", 0], ["created_at", "2020-10-29 15:12:56.334476"], ["updated_at", "2020-10-29 15:12:56.334476"]]
---
    def create
        # code to create a new pet from params
        # params = {name: "Petey", species: "cat"
        #           year_of_birth: 2020, good_with_kids: true}
        puts "post request to /pets has been made and now we're here"
        pet = Pet.create(name: params[:name],
                   species: params[:species],
                   year_of_birth: params[:year_of_birth],
                   good_with_kids: params[:good_with_kids])

SELECT "pets".* FROM "pets"
---
    def dogs
        # @pets = Pet.all
        @dogs = Pet.all.select {|pet| pet.species == "dog"}

SELECT "pets".* FROM "pets"
---
    def cats
        @cats = Pet.all.select {|pet| pet.species == "cat"}

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
---
    def type
        @birds =Pet.find(params[:species])

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "pets" SET "good_with_kids" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["good_with_kids", 1], ["updated_at", "2020-10-29 15:55:42.171410"], ["id", 54]]
---
    def toggle_good_with_kids
        pet = Pet.find(params[:id])
        pet.good_with_kids = !pet.good_with_kids
        pet.save